<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b4a91ce93611879723e732e0593da3d537289c009919358bfee1db424076bf3a","plan_job_ref":"Job Run Terraform plan in staging #164 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12815720954","plan_out_hash":"9355f1aabc6678a37f36c8deb57a589e8f0db7d9a04df49bcc87811e7250d135","plan_hash":"897fc132aaa7bc24868153dae1370741ed7976ab64c88b3f3d53698b8e160a18","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "3cd9d08dd2cee92fc231257cd7405254dc6d0cf0b4540c9e307eefd81beba0c4" -> "59e07347902f0f8808366b9a0f3fc17eeec3889f26ee71a08eecc006e669bd51"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-16T18:35:21Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #164](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12815720954)